---
kind: enumMember
id: F:Autodesk.Revit.DB.WidthMeasuredAt.Top
enum: Autodesk.Revit.DB.WidthMeasuredAt
source: html/71ec86d8-1032-1d91-0114-bc29d8e5d48b.htm
---
# Autodesk.Revit.DB.WidthMeasuredAt.Top

The top of the wall taking into account the top offset before any attachment.